cases/snappyHexMesh/steady/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{  
    exposed        
    {    
		type            nutkWallFunction;
        value           uniform 0;
	}
	solidWall      
    {   
		type            nutkWallFunction;
        value           uniform 0;
    }
	
	wallRhoC      
    {   
		type            nutkWallFunction;
        value           uniform 0;
    }

    front     
    {
		type            empty; 
    }
   
	back 
	{
		type            empty;  	
	}

	top
	{
		type            calculated;
        value           uniform 0;
    }
	
	bottom
	{
		type            nutkWallFunction;
        value           uniform 0;
    }
	
	inlet
	{
		type            calculated;
        value           uniform 0;
    }
	
	outlet
	{
		type            calculated;
        value           uniform 0; 
    }
}

// ************************************************************************* //